In [34]:
import pandas as pd

In [58]:
pop_df = pd.read_csv('population/Data of Population 2002 to 2023.csv')
pop_df = pop_df[[ 'ADM1_EN','Month','Year', 'Population']]
pop_df =pop_df.rename({'ADM1_EN':'province','Month':'month','Year':'year','Population':'population'},axis=1)
pop_df = pop_df.replace({'Loburi': 'Lop Buri','Buang Kan':'Nong Khai'})
pop_df = pop_df.groupby(['province','month','year']).sum().reset_index()
pop_df.head(5)

        province  month  year  population
0  Amnat Charoen      1  2002    368416.0
1  Amnat Charoen      1  2003    370133.0
2  Amnat Charoen      1  2004    372071.0
3  Amnat Charoen      1  2005    367659.0
4  Amnat Charoen      1  2006    368779.0

In [59]:
climate_df = pd.read_csv('terraclimate/climate_data_terra_2003_2023_bio_76prov.csv')
climate_df = climate_df[['province','month','year',]+[x for x in climate_df.columns if x not in ['province','month','year']]]
climate_df = climate_df.replace({'Loburi': 'Lop Buri','Buang Kan':'Nong Khai'})
climate_df = climate_df.groupby(['province','month','year']).mean().reset_index()
climate_df.head(5)

,province,month,year,PPT,TMAX,TMIN,SOIL,VAP,VPD,WS,...,Bio 10,Bio 11,Bio 12,Bio 13,Bio 14,Bio 15,Bio 16,Bio 17,Bio 18,Bio 19
0,Amnat Charoen,1,2003,0.117361,30.417500,16.233681,84.517708,1.747604,1.361509,1.975382,...,29.831944,23.274809,1503.060417,396.860069,0.000000,109.630403,907.753472,6.700347,486.148264,47.514583
1,Amnat Charoen,1,2004,6.560069,31.535868,16.890382,65.236111,1.890591,1.405157,1.488056,...,29.943513,24.686753,1562.074653,391.653125,0.000000,108.572168,962.190625,0.010069,326.372569,2.422569
2,Amnat Charoen,1,2005,0.010069,31.375486,16.935764,58.288542,1.807881,1.466667,1.511007,...,29.731939,24.655486,1558.160417,385.892014,0.000000,111.237949,1014.241667,12.224306,458.397569,27.410417
3,Amnat Charoen,1,2006,0.000000,31.106250,16.676458,71.036458,1.730220,1.495409,1.830035,...,28.932188,23.639635,1622.153819,393.413194,0.000000,97.382250,910.467361,12.972917,333.641319,12.972917
4,Amnat Charoen,1,2007,0.648611,30.058160,16.772569,93.368056,1.690113,1.409434,2.628090,...,28.993947,24.166233,1633.188542,359.324653,0.178125,93.885732,833.796180,3.303472,362.952778,10.679514

In [64]:
dengue_df = pd.read_csv('dengue/combine_dengue_province_monthly_77provinces.csv')
dengue_df = dengue_df.rename({'province':'province','count':'dengue_cases'},axis=1)
dengue_df = dengue_df[['province','month','year','dengue_cases',]]
dengue_df = dengue_df.replace({'Loburi': 'Lop Buri','Bueng Kan':'Nong Khai'})
dengue_df = dengue_df[dengue_df['year']!=2024]
dengue_df.head(5)

                   province  month  year  dengue_cases
0                   Bangkok      1  2003           761
1              Samut Prakan      1  2003            85
2                Nonthaburi      1  2003            90
3              Pathum Thani      1  2003            39
4  Phra Nakhon Si Ayutthaya      1  2003            10

In [70]:
merged_df = pd.merge(dengue_df,climate_df,on=['province','month','year'],how='left')
merged_df = pd.merge(merged_df,pop_df,on=['province','month','year'],how='left')
merged_df['dengue_rate'] = (merged_df['dengue_cases'] / merged_df['population']) * 100000
merged_df = merged_df.sort_values(['province','year','month'])
merged_df = merged_df[['province','month','year','dengue_cases', 'dengue_rate', ] + [x for x in merged_df.columns if x not in ['province','month','year','dengue_cases', 'dengue_rate',]]]
merged_df.to_csv('../dataset/historical_combine_dengue_CaseRate_terra_monthly_76provinces_population.csv',index=False)